[
  {
    "id": 1,
    "nome": "Adivinhe o Número",
    "tecnologias": ["HTML", "CSS", "JavaScript"],
    "imagem": "/adivinhe_o_numero.png",
    "descricao": "O jogador terá 10 chances para adivinhar um número sorteado entre 0 e 1000. Caso erre o palpite, será informado se o número digitado é maior ou menor que o sorteado. Se acertar, receberá uma mensagem de parabéns, mas, se errar todas as tentativas, será informado que perdeu o jogo e poderá tentar novamente.",
    "linkTeste": "https://rafaelpa13.github.io/Adivinhe-o-numero/",
    "linkRepositorio": "https://github.com/RafaelPA13/Adivinhe-o-numero.git"
  },
  {
    "id": 2,
    "nome": "App Clima",
    "tecnologias": ["HTML", "CSS", "JavaScript"],
    "imagem": "/app_clima.png",
    "descricao": "O usuário pode pesquisar a temperatura, umidade e velocidade do vento de diversas cidades ao redor do mundo, seja utilizando a barra de pesquisa ou as opções listadas nos botões abaixo. Este projeto utiliza a API OpenWeather para consultar as informações.",
    "linkTeste": "https://app-clima-five-psi.vercel.app",
    "linkRepositorio": "https://github.com/RafaelPA13/App-clima.git"
  },
  {
    "id": 3,
    "nome": "Consulta Tabela FIPE",
    "tecnologias": ["Java", "Spring"],
    "imagem": "/consulta_tabela_fipe.png",
    "descricao": "Esta é uma aplicação back-end, cujo a utilidade seria de pesquisar os valores médios de veículos como carros, motos e caminhões de acordo com a tabela FIPE, o projeto foi criado utilizando Java e o framwork spring, e consulta as informações por meio da API FIPE API HTTP REST.",
    "linkTeste": "",
    "linkRepositorio": "https://github.com/RafaelPA13/Consulta_Tabela_FIPE.git"
  },
  {
    "id": 4,
    "nome": "Consulta CEP",
    "tecnologias": ["Java"],
    "imagem": "/consulta_cep.png",
    "descricao": "Esta é uma aplicação back-end, onde o usuário pode pesquisar endereços por meio do Código de Endereçamento Postal (CEP). O projeto consulta as informações por meio da API ViaCEP.",
    "linkTeste": "",
    "linkRepositorio": "https://github.com/RafaelPA13/Consulta_CEP.git"
  },
  {
    "id": 5,
    "nome": "Lista de Tarefas",
    "tecnologias": ["React"],
    "imagem": "/lista_de_tarefas.png",
    "descricao": "Uma aplicação de gerenciamento de tarefas com um sistema de autenticação. O usuário pode criar uma conta no sistema, além de criar, atualizar e deletar suas próprias tarefas. Este projeto utiliza o framework React, Firebase Authentication e Firestore.",
    "linkTeste": "https://lista-de-tarefas-xi-one.vercel.app",
    "linkRepositorio": "https://github.com/RafaelPA13/lista_de_tarefas.git"
  },
  {
    "id": 6,
    "nome": "Sistema de cadastro e remoção de lixo",
    "tecnologias": ["Python"],
    "imagem": "/Sistema-de-cadastro-e-remocao-de-lixo.avif",
    "descricao": "Este projeto realiza o cadastro e a remoção dos lixos encontrados nos oceanos fornecidos pelos usuários, como plástico, vidro, metal e madeira, os tipos mais encontrados no ecossistema marítimo. O sistema garante que apenas itens não numéricos sejam adicionados ou removidos das respectivas listas.",
    "linkTeste": "",
    "linkRepositorio": "https://github.com/RafaelPA13/Sistema-de-cadastro-e-remocao-de-lixo.git"
  }
]
